app/controllers/games_controller.rb

SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1
SELECT "games".* FROM "games"
SELECT "users".* FROM "users"
SELECT "moves".* FROM "moves"
SELECT  "moves".* FROM "moves"  WHERE "moves"."game_id" = 281 ORDER BY "moves"."id" DESC LIMIT 1
INSERT INTO "moves" ("created_at", "game_id", "player_id", "square_id", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "moves".* FROM "moves"  WHERE "moves"."game_id" = 281
---
  def show
    @game = Game.find(params[:id])
    @games = Game.all
    @moves = @game.moves
    @user = User.all
    @users_moves = []
    @comps_moves = []
    @player_2 = []
    @move = Move.all
    winning_line = [
        [1,2,3], [4,5,6], [7,8,9],
        [1,4,7], [2,5,8], [3,6,9],
        [1,5,9], [3,5,7]
      ]


    @user.each do |user|
      @user_name = user.name
    end

    if params[:player_move]

      if @moves.last
          if @moves.last.player_id
            @moves.create(square_id: params[:player_move])
          else
            @moves.create(square_id: params[:player_move], player_id: 1)
          end
      else
           @moves.create(square_id: params[:player_move], player_id: 1)
      end


        @all_moves = @game.moves.map do

INSERT INTO "moves" ("created_at", "game_id", "player_id", "square_id", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "moves".* FROM "moves"  WHERE "moves"."game_id" = 281 AND "moves"."player_id" = 1
---
        if @game.player2_id == "Computer"
          comp_move = availiable_moves.sample

          @game.moves.create(square_id: comp_move)
        end

        @users_moves = @game.moves.where(player_id: 1).map do |move| move.square_id.to_i

SELECT "moves".* FROM "moves"  WHERE "moves"."game_id" = 281 AND "moves"."player_id" IS NULL
---
        # @player_2 = @game.moves.where(player2_id: 1).map do |move| move.square_id.to_i
        # end

        @comps_moves = @game.moves.where(player_id: nil).map do |move| move.square_id.to_i

SELECT "users".* FROM "users"
INSERT INTO "games" ("created_at", "player2_id", "updated_at", "user_id", "winner_id") VALUES (?, ?, ?, ?, ?)
---
def create
  @game = Game.new(params[:game])
  @user = User.all


  respond_to do |format|
      if @game.save